[Survived] BooleanLiteral
src/EM.ts:26:27
   private upgraders: Array<EventUpgrader<Event>>;
   private eventBus: EventBus<Event>;
   private logger: Logger<Event>;
-  private isInitialized = false;
+  private isInitialized = true;
 
   public static async create<

[Killed] ArrayDeclaration
src/EM.ts:34:17
   >({
     events,
     repository = new InMemoryRepository<EventCreate>(),
-    upgraders = [],
+    upgraders = ["Stryker was here"],
     logger = new VoidLogger(),
   }: {
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: TypeError: upgrader.upgrade is not a function

[Killed] BlockStatement
src/EM.ts:41:50
     repository?: Repository<EventCreate>;
     upgraders?: Array<EventUpgrader<EventCreate>>;
     logger?: Logger<EventCreate>;
-  }): Promise<EM<EventCreate, InputEventCreate>> {
-    const em = new EM<EventCreate, InputEventCreate>({
-      events,
-      repository,
-      upgraders,
-      logger,
-    });
-    await em.init();
-    return em;
-  }
+  }): Promise<EM<EventCreate, InputEventCreate>> {}
 
   private constructor({
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'emit')

[Killed] BlockStatement
src/EM.ts:62:6
     repository?: Repository<Event>;
     upgraders?: Array<EventUpgrader<Event>>;
     logger?: Logger<Event>;
-  }) {
-    this.events = events;
-    this.repo = repository;
-    this.upgraders = upgraders;
-    this.logger = logger;
-    this.eventBus = new EventBus<Event>(this.repo, this.logger);
-  }
+  }) {}
 
   public async init(): Promise<void> {
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'validateEventsTable')

[Killed] BlockStatement
src/EM.ts:70:38
     this.eventBus = new EventBus<Event>(this.repo, this.logger);
   }
 
-  public async init(): Promise<void> {
-    this.repo.validateEventsTable();
-    this.repo.validateStreamsTable();
-    this.isInitialized = true;
-  }
+  public async init(): Promise<void> {}
 
   private applyUpgrades(event: Event): Event {
killedBy: Replay with Multiple Event Types
statusReason: EM is not initialized. Please call EM.init() first.

[Killed] BooleanLiteral
src/EM.ts:73:26
   public async init(): Promise<void> {
     this.repo.validateEventsTable();
     this.repo.validateStreamsTable();
-    this.isInitialized = true;
+    this.isInitialized = false;
   }
 
killedBy: Replay with Multiple Event Types
statusReason: EM is not initialized. Please call EM.init() first.

[Killed] BlockStatement
src/EM.ts:76:46
     this.isInitialized = true;
   }
 
-  private applyUpgrades(event: Event): Event {
-    return this.upgraders.reduce(
-      (upgradedEvent, upgrader) => upgrader.upgrade(upgradedEvent),
-      event
-    );
-  }
+  private applyUpgrades(event: Event): Event {}
 
   /**
killedBy: Replay with Multiple Event Types
statusReason: Event emission failed: TypeError: Cannot set properties of undefined (setting 'seq')

[Killed] ArrowFunction
src/EM.ts:78:7
 
   private applyUpgrades(event: Event): Event {
     return this.upgraders.reduce(
-      (upgradedEvent, upgrader) => upgrader.upgrade(upgradedEvent),
+      () => undefined,
       event
     );
killedBy: Replay with Multiple Event Types
statusReason: Event emission failed: TypeError: Cannot set properties of undefined (setting 'seq')

[NoCoverage] BlockStatement
src/EM.ts:87:69
    * Emit multiple events after parsing and applying upgrades.
    * @param events - The events to emit.
    */
-  public async emitEvents(events: Array<InputEvent>): Promise<void> {
-    for (const event of events) {
-      // eslint-disable-next-line no-await-in-loop
-      await this.emit(event);
-    }
-  }
+  public async emitEvents(events: Array<InputEvent>): Promise<void> {}
 
   /**

[NoCoverage] BlockStatement
src/EM.ts:88:33
    * @param events - The events to emit.
    */
   public async emitEvents(events: Array<InputEvent>): Promise<void> {
-    for (const event of events) {
-      // eslint-disable-next-line no-await-in-loop
-      await this.emit(event);
-    }
+    for (const event of events) {}
   }
 

[Killed] BlockStatement
src/EM.ts:99:55
    * @param event - The event to emit.
    * @throws Will throw an error if the event emission fails.
    */
-  public async emit(event: InputEvent): Promise<void> {
-    if (!this.isInitialized) {
-      throw new Error("EM is not initialized. Please call EM.init() first.");
-    }
-    try {
-      const parsedEvent = this.events.parse(event) as Event;
-      const upgradedEvent = this.applyUpgrades(parsedEvent);
-      await this.repo.emitEvent(upgradedEvent);
-      await Promise.all([
-        this.eventBus.publish(parsedEvent),
-        this.logger.logEvent(upgradedEvent),
-      ]);
-    } catch (error) {
-      this.logger.error(
-        `Failed to emit event: ${
-          error instanceof ZodError ? error.message : error
-        }`
-      );
-
-      throw new Error(`Event emission failed: ${error}`);
-    }
-  }
+  public async emit(event: InputEvent): Promise<void> {}
 
   /**
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/EM.ts:100:9
    * @throws Will throw an error if the event emission fails.
    */
   public async emit(event: InputEvent): Promise<void> {
-    if (!this.isInitialized) {
+    if (true) {
       throw new Error("EM is not initialized. Please call EM.init() first.");
     }
killedBy: Replay with Multiple Event Types
statusReason: EM is not initialized. Please call EM.init() first.

[Killed] BooleanLiteral
src/EM.ts:100:9
    * @throws Will throw an error if the event emission fails.
    */
   public async emit(event: InputEvent): Promise<void> {
-    if (!this.isInitialized) {
+    if (this.isInitialized) {
       throw new Error("EM is not initialized. Please call EM.init() first.");
     }
killedBy: Replay with Multiple Event Types
statusReason: EM is not initialized. Please call EM.init() first.

[Killed] BlockStatement
src/EM.ts:103:9
     if (!this.isInitialized) {
       throw new Error("EM is not initialized. Please call EM.init() first.");
     }
-    try {
-      const parsedEvent = this.events.parse(event) as Event;
-      const upgradedEvent = this.applyUpgrades(parsedEvent);
-      await this.repo.emitEvent(upgradedEvent);
-      await Promise.all([
-        this.eventBus.publish(parsedEvent),
-        this.logger.logEvent(upgradedEvent),
-      ]);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(
         `Failed to emit event: ${
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/EM.ts:111:21
         this.eventBus.publish(parsedEvent),
         this.logger.logEvent(upgradedEvent),
       ]);
-    } catch (error) {
-      this.logger.error(
-        `Failed to emit event: ${
-          error instanceof ZodError ? error.message : error
-        }`
-      );
-
-      throw new Error(`Event emission failed: ${error}`);
-    }
+    } catch (error) {}
   }
 
killedBy: Emit Event with Same ID Twice
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/EM.ts:129:37
    */
   public async *replay(
     query: ReplayQuery<Event>
-  ): AsyncIterable<Readonly<Event>> {
-    if (!this.isInitialized) {
-      throw new Error("EM is not initialized. Please call EM.init() first.");
-    }
-    for await (const event of this.repo.replay(query)) {
-      const upgradedEvent = this.applyUpgrades(event);
-      yield upgradedEvent;
-      await this.logger.logEvent(upgradedEvent);
-    }
-  }
+  ): AsyncIterable<Readonly<Event>> {}
 
   public getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/EM.ts:130:9
   public async *replay(
     query: ReplayQuery<Event>
   ): AsyncIterable<Readonly<Event>> {
-    if (!this.isInitialized) {
+    if (this.isInitialized) {
       throw new Error("EM is not initialized. Please call EM.init() first.");
     }
killedBy: Replay with Multiple Event Types
statusReason: EM is not initialized. Please call EM.init() first.

[Killed] ConditionalExpression
src/EM.ts:130:9
   public async *replay(
     query: ReplayQuery<Event>
   ): AsyncIterable<Readonly<Event>> {
-    if (!this.isInitialized) {
+    if (true) {
       throw new Error("EM is not initialized. Please call EM.init() first.");
     }
killedBy: Replay with Multiple Event Types
statusReason: EM is not initialized. Please call EM.init() first.

[Killed] BlockStatement
src/EM.ts:133:56
     if (!this.isInitialized) {
       throw new Error("EM is not initialized. Please call EM.init() first.");
     }
-    for await (const event of this.repo.replay(query)) {
-      const upgradedEvent = this.applyUpgrades(event);
-      yield upgradedEvent;
-      await this.logger.logEvent(upgradedEvent);
-    }
+    for await (const event of this.repo.replay(query)) {}
   }
 
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/EM.ts:140:68
     }
   }
 
-  public getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {
-    return this.repo.getAllEntityStreams();
-  }
+  public getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {}
 
   public getAllEvents(): AsyncIterable<Readonly<Event>> {
killedBy: Emit Events and Check Streams
statusReason: Cannot read properties of undefined (reading 'Symbol(Symbol.asyncIterator)')

[Killed] BlockStatement
src/EM.ts:144:57
     return this.repo.getAllEntityStreams();
   }
 
-  public getAllEvents(): AsyncIterable<Readonly<Event>> {
-    return this.repo.getAllEvents();
-  }
+  public getAllEvents(): AsyncIterable<Readonly<Event>> {}
 
   public subscribe(
killedBy: Emit Events and Validate Emission
statusReason: Cannot read properties of undefined (reading 'Symbol(Symbol.asyncIterator)')

[Killed] BlockStatement
src/EM.ts:151:11
   public subscribe(
     query: SubscriptionQuery<Event>,
     handler: EventHandler<Event>
-  ): void {
-    this.eventBus.subscribe(query, handler);
-  }
+  ): void {}
 }
 
killedBy: Basic Event Bus
statusReason: expected +0 to be 1 // Object.is equality
