[Survived] ArrayDeclaration
src/EventBus.ts:12:8
   private handlers: Array<{
     query: SubscriptionQuery<Event>;
     handler: EventHandler<Event>;
-  }> = [];
+  }> = ["Stryker was here"];
   private logger: Logger<Event>;
   private repo: Repository<Event>;

[Survived] BlockStatement
src/EventBus.ts:19:5
   constructor(
     repo: Repository<Event>,
     logger: Logger<Event> = new VoidLogger()
-  ) {
-    this.logger = logger;
-    this.repo = repo;
-  }
+  ) {}
 
   /**

[Killed] BlockStatement
src/EventBus.ts:31:11
   public subscribe(
     query: SubscriptionQuery<Event>,
     handler: EventHandler<Event>
-  ): void {
-    this.handlers.push({
-      query,
-      handler,
-    });
-  }
+  ): void {}
 
   public async catchUpAndSubscribe(
killedBy: Basic Event Bus
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/EventBus.ts:32:24
     query: SubscriptionQuery<Event>,
     handler: EventHandler<Event>
   ): void {
-    this.handlers.push({
-      query,
-      handler,
-    });
+    this.handlers.push({});
   }
 
killedBy: Basic Event Bus
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] BlockStatement
src/EventBus.ts:41:5
   public async catchUpAndSubscribe(
     query: SubscriptionQuery<Event>,
     handler: EventHandler<Event>
-  ) {
-    const events = this.repo.replay(query);
-    for await (const event of events) {
-      await handler(event);
-    }
-    this.subscribe(query, handler);
-  }
+  ) {}
 
   /**

[NoCoverage] BlockStatement
src/EventBus.ts:43:39
     handler: EventHandler<Event>
   ) {
     const events = this.repo.replay(query);
-    for await (const event of events) {
-      await handler(event);
-    }
+    for await (const event of events) {}
     this.subscribe(query, handler);
   }

[Killed] BlockStatement
src/EventBus.ts:53:46
    * Publish an event to all subscribed handlers.
    * @param event - The event to publish.
    */
-  async publish(event: Event): Promise<void> {
-    for (const item of this.handlers) {
-      try {
-        // eslint-disable-next-line no-await-in-loop
-        await item.handler(event);
-        // If (item.query.entityId && item.query.entityId !== event.entityId) {
-        //
-        //   Await item.handler(event);
-        // }
-      } catch (error) {
-        // Handle individual handler errors without disrupting others
-        this.logger.error(`Error in handler: ${error}`);
-      }
-    }
-  }
+  async publish(event: Event): Promise<void> {}
 }
 
killedBy: Basic Event Bus
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/EventBus.ts:54:39
    * @param event - The event to publish.
    */
   async publish(event: Event): Promise<void> {
-    for (const item of this.handlers) {
-      try {
-        // eslint-disable-next-line no-await-in-loop
-        await item.handler(event);
-        // If (item.query.entityId && item.query.entityId !== event.entityId) {
-        //
-        //   Await item.handler(event);
-        // }
-      } catch (error) {
-        // Handle individual handler errors without disrupting others
-        this.logger.error(`Error in handler: ${error}`);
-      }
-    }
+    for (const item of this.handlers) {}
   }
 }
killedBy: Basic Event Bus
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/EventBus.ts:55:11
    */
   async publish(event: Event): Promise<void> {
     for (const item of this.handlers) {
-      try {
-        // eslint-disable-next-line no-await-in-loop
-        await item.handler(event);
-        // If (item.query.entityId && item.query.entityId !== event.entityId) {
-        //
-        //   Await item.handler(event);
-        // }
-      } catch (error) {
+      try {} catch (error) {
         // Handle individual handler errors without disrupting others
         this.logger.error(`Error in handler: ${error}`);
killedBy: Basic Event Bus
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] BlockStatement
src/EventBus.ts:62:23
         //
         //   Await item.handler(event);
         // }
-      } catch (error) {
-        // Handle individual handler errors without disrupting others
-        this.logger.error(`Error in handler: ${error}`);
-      }
+      } catch (error) {}
     }
   }
