[NoCoverage] BlockStatement
src/loggers/Console.logger.ts:8:52
 export class ConsoleLogger<Event extends BaseEventType>
   implements Logger<Event>
 {
-  public async error(error: string): Promise<void> {
-    console.error(error);
-  }
+  public async error(error: string): Promise<void> {}
   public async logEvent(event: Event): Promise<void> {
     console.log(

[NoCoverage] BlockStatement
src/loggers/Console.logger.ts:11:54
   public async error(error: string): Promise<void> {
     console.error(error);
   }
-  public async logEvent(event: Event): Promise<void> {
-    console.log(
-      `Event emitted: ${event.type} for ${event.entityId}: ${JSON.stringify(
-        event.payload,
-        null,
-        4
-      )}`
-    );
-  }
+  public async logEvent(event: Event): Promise<void> {}
 }
 
