[Killed] UnaryOperator
src/repos/InMemory.repository.ts:16:24
   private readonly events: Array<Readonly<Event>> = [];
   private readonly streams: Array<EntityStream<Event>> = [];
   // Current sequence number starts at -1 so that the first event will have a sequence number of 0
-  private currentSeq = -1;
+  private currentSeq = +1;
   private readonly seqMutex = new Mutex();
 
killedBy: Replay with Sequence Range
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:28:42
   }
   private doesEventMatchQuery(
     query: ReplayQuery<Readonly<Event>>
-  ): (event: Readonly<Event>) => boolean {
-    return (event: Readonly<Event>): boolean =>
-      this.matchStreamId(event, query) &&
-      this.matchSeqFrom(event, query) &&
-      this.matchSeqTo(event, query) &&
-      this.matchEventTypes(event, query) &&
-      this.matchPayload(event, query) &&
-      this.matchCreatedAtFrom(event, query) &&
-      this.matchCreatedAtTo(event, query);
-  }
+  ): (event: Readonly<Event>) => boolean {}
   private matchStreamId = (
     event: Readonly<Event>,
killedBy: Replay with Multiple Event Types
statusReason: undefined is not a function

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:29:12
   private doesEventMatchQuery(
     query: ReplayQuery<Readonly<Event>>
   ): (event: Readonly<Event>) => boolean {
-    return (event: Readonly<Event>): boolean =>
-      this.matchStreamId(event, query) &&
-      this.matchSeqFrom(event, query) &&
-      this.matchSeqTo(event, query) &&
-      this.matchEventTypes(event, query) &&
-      this.matchPayload(event, query) &&
-      this.matchCreatedAtFrom(event, query) &&
-      this.matchCreatedAtTo(event, query);
+    return () => undefined;
   }
   private matchStreamId = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/repos/InMemory.repository.ts:30:7
     query: ReplayQuery<Readonly<Event>>
   ): (event: Readonly<Event>) => boolean {
     return (event: Readonly<Event>): boolean =>
-      this.matchStreamId(event, query) &&
-      this.matchSeqFrom(event, query) &&
-      this.matchSeqTo(event, query) &&
+      this.matchStreamId(event, query) && this.matchSeqFrom(event, query) || this.matchSeqTo(event, query) &&
       this.matchEventTypes(event, query) &&
       this.matchPayload(event, query) &&
killedBy: Replay with No Matching Events
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/repos/InMemory.repository.ts:30:7
     query: ReplayQuery<Readonly<Event>>
   ): (event: Readonly<Event>) => boolean {
     return (event: Readonly<Event>): boolean =>
-      this.matchStreamId(event, query) &&
-      this.matchSeqFrom(event, query) &&
+      this.matchStreamId(event, query) || this.matchSeqFrom(event, query) &&
       this.matchSeqTo(event, query) &&
       this.matchEventTypes(event, query) &&
killedBy: Replay with No Matching Events
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:38:27
       this.matchCreatedAtFrom(event, query) &&
       this.matchCreatedAtTo(event, query);
   }
-  private matchStreamId = (
-    event: Readonly<Event>,
-    query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.entityId || event.entityId === query.entityId;
+  private matchStreamId = () => undefined;
 
   private matchSeqFrom = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/repos/InMemory.repository.ts:41:36
   private matchStreamId = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.entityId || event.entityId === query.entityId;
+  ): boolean => !query.entityId || event.entityId !== query.entityId;
 
   private matchSeqFrom = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:41:17
   private matchStreamId = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.entityId || event.entityId === query.entityId;
+  ): boolean => true;
 
   private matchSeqFrom = (
killedBy: Replay with No Matching Events
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:43:26
     query: ReplayQuery<Readonly<Event>>
   ): boolean => !query.entityId || event.entityId === query.entityId;
 
-  private matchSeqFrom = (
-    event: Readonly<Event>,
-    query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.seq?.from || event.seq >= query.seq.from;
+  private matchSeqFrom = () => undefined;
 
   private matchSeqTo = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/repos/InMemory.repository.ts:46:37
   private matchSeqFrom = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.seq?.from || event.seq >= query.seq.from;
+  ): boolean => !query.seq?.from || event.seq < query.seq.from;
 
   private matchSeqTo = (
killedBy: Replay with Sequence Range
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:46:17
   private matchSeqFrom = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.seq?.from || event.seq >= query.seq.from;
+  ): boolean => query.seq?.from || event.seq >= query.seq.from;
 
   private matchSeqTo = (
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'from')

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:48:24
     query: ReplayQuery<Readonly<Event>>
   ): boolean => !query.seq?.from || event.seq >= query.seq.from;
 
-  private matchSeqTo = (
-    event: Readonly<Event>,
-    query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.seq?.to || event.seq <= query.seq.to;
+  private matchSeqTo = () => undefined;
 
   private matchEventTypes = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:51:17
   private matchSeqTo = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.seq?.to || event.seq <= query.seq.to;
+  ): boolean => query.seq?.to || event.seq <= query.seq.to;
 
   private matchEventTypes = (
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'to')

[Killed] EqualityOperator
src/repos/InMemory.repository.ts:51:35
   private matchSeqTo = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.seq?.to || event.seq <= query.seq.to;
+  ): boolean => !query.seq?.to || event.seq < query.seq.to;
 
   private matchEventTypes = (
killedBy: Replay with Sequence Range
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:53:29
     query: ReplayQuery<Readonly<Event>>
   ): boolean => !query.seq?.to || event.seq <= query.seq.to;
 
-  private matchEventTypes = (
-    event: Readonly<Event>,
-    query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.eventTypes || query.eventTypes.includes(event.type);
+  private matchEventTypes = () => undefined;
 
   private matchPayload = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:56:17
   private matchEventTypes = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.eventTypes || query.eventTypes.includes(event.type);
+  ): boolean => query.eventTypes || query.eventTypes.includes(event.type);
 
   private matchPayload = (
killedBy: Replay with Sequence Range
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] LogicalOperator
src/repos/InMemory.repository.ts:56:17
   private matchEventTypes = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.eventTypes || query.eventTypes.includes(event.type);
+  ): boolean => !query.eventTypes && query.eventTypes.includes(event.type);
 
   private matchPayload = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:61:17
   private matchPayload = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => {
-    if (!query.payload) {
-      return true;
-    }
-    for (const key in query.payload) {
-      if (query.payload[key] !== event.payload[key]) {
-        return false;
-      }
-    }
-    return true;
-  };
+  ): boolean => {};
 
   private matchCreatedAtFrom = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:62:9
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
   ): boolean => {
-    if (!query.payload) {
+    if (query.payload) {
       return true;
     }
killedBy: Replay with Specific Payload
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:62:9
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
   ): boolean => {
-    if (!query.payload) {
+    if (true) {
       return true;
     }
killedBy: Replay with Specific Payload
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:63:14
     query: ReplayQuery<Readonly<Event>>
   ): boolean => {
     if (!query.payload) {
-      return true;
+      return false;
     }
     for (const key in query.payload) {
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:65:38
     if (!query.payload) {
       return true;
     }
-    for (const key in query.payload) {
-      if (query.payload[key] !== event.payload[key]) {
-        return false;
-      }
-    }
+    for (const key in query.payload) {}
     return true;
   };
killedBy: Replay with Specific Payload
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:66:54
       return true;
     }
     for (const key in query.payload) {
-      if (query.payload[key] !== event.payload[key]) {
-        return false;
-      }
+      if (query.payload[key] !== event.payload[key]) {}
     }
     return true;
killedBy: Replay with Specific Payload
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
src/repos/InMemory.repository.ts:66:11
       return true;
     }
     for (const key in query.payload) {
-      if (query.payload[key] !== event.payload[key]) {
+      if (query.payload[key] === event.payload[key]) {
         return false;
       }
killedBy: Replay with Specific Payload
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:67:16
     }
     for (const key in query.payload) {
       if (query.payload[key] !== event.payload[key]) {
-        return false;
+        return true;
       }
     }
killedBy: Replay with Specific Payload
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:73:32
     return true;
   };
 
-  private matchCreatedAtFrom = (
-    event: Readonly<Event>,
-    query: ReplayQuery<Readonly<Event>>
-  ): boolean =>
-    !query.createdAt?.from || event.createdAt >= query.createdAt.from;
+  private matchCreatedAtFrom = () => undefined;
 
   private matchCreatedAtTo = (
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
src/repos/InMemory.repository.ts:77:6
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
   ): boolean =>
-    !query.createdAt?.from || event.createdAt >= query.createdAt.from;
+    !query.createdAt.from || event.createdAt >= query.createdAt.from;
 
   private matchCreatedAtTo = (
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'from')

[Killed] EqualityOperator
src/repos/InMemory.repository.ts:77:31
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
   ): boolean =>
-    !query.createdAt?.from || event.createdAt >= query.createdAt.from;
+    !query.createdAt?.from || event.createdAt < query.createdAt.from;
 
   private matchCreatedAtTo = (
killedBy: Replay with CreatedAt Range
statusReason: expected 'https://example.com' to be 'https://example.com/page2' // Object.is equality

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:79:30
   ): boolean =>
     !query.createdAt?.from || event.createdAt >= query.createdAt.from;
 
-  private matchCreatedAtTo = (
-    event: Readonly<Event>,
-    query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.createdAt?.to || event.createdAt <= query.createdAt.to;
+  private matchCreatedAtTo = () => undefined;
 
   async *replay(
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:82:17
   private matchCreatedAtTo = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.createdAt?.to || event.createdAt <= query.createdAt.to;
+  ): boolean => query.createdAt?.to || event.createdAt <= query.createdAt.to;
 
   async *replay(
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'to')

[Killed] LogicalOperator
src/repos/InMemory.repository.ts:82:17
   private matchCreatedAtTo = (
     event: Readonly<Event>,
     query: ReplayQuery<Readonly<Event>>
-  ): boolean => !query.createdAt?.to || event.createdAt <= query.createdAt.to;
+  ): boolean => !query.createdAt?.to && event.createdAt <= query.createdAt.to;
 
   async *replay(
killedBy: Replay with Multiple Event Types
statusReason: Cannot read properties of undefined (reading 'to')

[Killed] BlockStatement
src/repos/InMemory.repository.ts:86:37
 
   async *replay(
     query: ReplayQuery<Readonly<Event>>
-  ): AsyncIterable<Readonly<Event>> {
-    const filteredEvents = this.events.filter(this.doesEventMatchQuery(query));
-    let sortedEvents = filteredEvents.sort(
-      (a, b) =>
-        new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
-    );
-    if (query.backwards === true) {
-      sortedEvents.reverse();
-    }
-    if (query.limit) {
-      sortedEvents = sortedEvents.slice(0, query.limit);
-    }
-    for (const event of sortedEvents) {
-      yield event;
-    }
-  }
+  ): AsyncIterable<Readonly<Event>> {}
 
   public async emitEvent(event: Event): Promise<void> {
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
src/repos/InMemory.repository.ts:87:28
   async *replay(
     query: ReplayQuery<Readonly<Event>>
   ): AsyncIterable<Readonly<Event>> {
-    const filteredEvents = this.events.filter(this.doesEventMatchQuery(query));
+    const filteredEvents = this.events;
     let sortedEvents = filteredEvents.sort(
       (a, b) =>
killedBy: Replay with No Matching Events
statusReason: expected 1 to be +0 // Object.is equality

[Survived] MethodExpression
src/repos/InMemory.repository.ts:88:24
     query: ReplayQuery<Readonly<Event>>
   ): AsyncIterable<Readonly<Event>> {
     const filteredEvents = this.events.filter(this.doesEventMatchQuery(query));
-    let sortedEvents = filteredEvents.sort(
-      (a, b) =>
-        new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
-    );
+    let sortedEvents = filteredEvents;
     if (query.backwards === true) {
       sortedEvents.reverse();

[Survived] ArrowFunction
src/repos/InMemory.repository.ts:89:7
   ): AsyncIterable<Readonly<Event>> {
     const filteredEvents = this.events.filter(this.doesEventMatchQuery(query));
     let sortedEvents = filteredEvents.sort(
-      (a, b) =>
-        new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
+      () => undefined
     );
     if (query.backwards === true) {

[Survived] ArithmeticOperator
src/repos/InMemory.repository.ts:90:9
     const filteredEvents = this.events.filter(this.doesEventMatchQuery(query));
     let sortedEvents = filteredEvents.sort(
       (a, b) =>
-        new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
+        new Date(a.createdAt).getTime() + new Date(b.createdAt).getTime()
     );
     if (query.backwards === true) {

[Killed] BlockStatement
src/repos/InMemory.repository.ts:92:35
       (a, b) =>
         new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
     );
-    if (query.backwards === true) {
-      sortedEvents.reverse();
-    }
+    if (query.backwards === true) {}
     if (query.limit) {
       sortedEvents = sortedEvents.slice(0, query.limit);
killedBy: Replay backwards
statusReason: expected [ …(4) ] to strictly equal [ …(4) ]

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:92:29
       (a, b) =>
         new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
     );
-    if (query.backwards === true) {
+    if (query.backwards === false) {
       sortedEvents.reverse();
     }
killedBy: Replay backwards
statusReason: expected [ …(4) ] to strictly equal [ …(4) ]

[Killed] MethodExpression
src/repos/InMemory.repository.ts:93:7
         new Date(a.createdAt).getTime() - new Date(b.createdAt).getTime()
     );
     if (query.backwards === true) {
-      sortedEvents.reverse();
+      sortedEvents;
     }
     if (query.limit) {
killedBy: Replay backwards
statusReason: expected [ …(4) ] to strictly equal [ …(4) ]

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:95:9
     if (query.backwards === true) {
       sortedEvents.reverse();
     }
-    if (query.limit) {
+    if (false) {
       sortedEvents = sortedEvents.slice(0, query.limit);
     }
killedBy: Replay backwards
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:95:22
     if (query.backwards === true) {
       sortedEvents.reverse();
     }
-    if (query.limit) {
-      sortedEvents = sortedEvents.slice(0, query.limit);
-    }
+    if (query.limit) {}
     for (const event of sortedEvents) {
       yield event;
killedBy: Replay backwards
statusReason: expected 4 to be 2 // Object.is equality

[Killed] MethodExpression
src/repos/InMemory.repository.ts:96:22
       sortedEvents.reverse();
     }
     if (query.limit) {
-      sortedEvents = sortedEvents.slice(0, query.limit);
+      sortedEvents = sortedEvents;
     }
     for (const event of sortedEvents) {
killedBy: Replay backwards
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:98:39
     if (query.limit) {
       sortedEvents = sortedEvents.slice(0, query.limit);
     }
-    for (const event of sortedEvents) {
-      yield event;
-    }
+    for (const event of sortedEvents) {}
   }
 
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:103:55
     }
   }
 
-  public async emitEvent(event: Event): Promise<void> {
-    const unlock = await this.seqMutex.lock();
-    try {
-      if (this.events.some((e) => e.id === event.id)) {
-        throw new Error(`Event with id ${event.id} already exists`);
-      }
-      this.currentSeq += 1;
-      event.seq = this.currentSeq;
-      this.events.push(event);
-      this.updateEntityStream(event);
-    } finally {
-      unlock();
-    }
-  }
+  public async emitEvent(event: Event): Promise<void> {}
 
   public async *getAllEvents(): AsyncIterable<Event> {
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:105:9
 
   public async emitEvent(event: Event): Promise<void> {
     const unlock = await this.seqMutex.lock();
-    try {
-      if (this.events.some((e) => e.id === event.id)) {
-        throw new Error(`Event with id ${event.id} already exists`);
-      }
-      this.currentSeq += 1;
-      event.seq = this.currentSeq;
-      this.events.push(event);
-      this.updateEntityStream(event);
-    } finally {
+    try {} finally {
       unlock();
     }
killedBy: Replay with Multiple Event Types
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:106:35
   public async emitEvent(event: Event): Promise<void> {
     const unlock = await this.seqMutex.lock();
     try {
-      if (this.events.some((e) => e.id === event.id)) {
+      if (this.events.some((e) => false)) {
         throw new Error(`Event with id ${event.id} already exists`);
       }
killedBy: Emit Event with Same ID Twice
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:106:35
   public async emitEvent(event: Event): Promise<void> {
     const unlock = await this.seqMutex.lock();
     try {
-      if (this.events.some((e) => e.id === event.id)) {
+      if (this.events.some((e) => true)) {
         throw new Error(`Event with id ${event.id} already exists`);
       }
killedBy: Replay with Multiple Event Types
statusReason: Event emission failed: Error: Event with id bc2612c3-96fd-4b80-8838-5b9307a358e7 already exists

[Killed] AssignmentOperator
src/repos/InMemory.repository.ts:109:7
       if (this.events.some((e) => e.id === event.id)) {
         throw new Error(`Event with id ${event.id} already exists`);
       }
-      this.currentSeq += 1;
+      this.currentSeq -= 1;
       event.seq = this.currentSeq;
       this.events.push(event);
killedBy: Replay with Sequence Range
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/repos/InMemory.repository.ts:113:15
       event.seq = this.currentSeq;
       this.events.push(event);
       this.updateEntityStream(event);
-    } finally {
-      unlock();
-    }
+    } finally {}
   }
 
killedBy: Replay with Multiple Event Types
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/repos/InMemory.repository.ts:118:54
     }
   }
 
-  public async *getAllEvents(): AsyncIterable<Event> {
-    for (const event of this.events) {
-      yield event;
-    }
-  }
+  public async *getAllEvents(): AsyncIterable<Event> {}
 
   public async *getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {
killedBy: Emit Events and Validate Emission
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/repos/InMemory.repository.ts:119:38
   }
 
   public async *getAllEvents(): AsyncIterable<Event> {
-    for (const event of this.events) {
-      yield event;
-    }
+    for (const event of this.events) {}
   }
 
killedBy: Emit Events and Validate Emission
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/repos/InMemory.repository.ts:124:75
     }
   }
 
-  public async *getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {
-    for (const stream of this.streams) {
-      yield stream;
-    }
-  }
+  public async *getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {}
 
   private updateEntityStream(event: Event): void {
killedBy: Emit Events and Check Streams
statusReason: expected [] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] BlockStatement
src/repos/InMemory.repository.ts:125:40
   }
 
   public async *getAllEntityStreams(): AsyncIterable<EntityStream<Event>> {
-    for (const stream of this.streams) {
-      yield stream;
-    }
+    for (const stream of this.streams) {}
   }
 
killedBy: Emit Events and Check Streams
statusReason: expected [] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:131:9
   }
 
   private updateEntityStream(event: Event): void {
-    if (event.entityId) {
+    if (false) {
       const stream = this.streams.find(
         (s) =>
killedBy: Emit Events and Check Streams
statusReason: expected [] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] BlockStatement
src/repos/InMemory.repository.ts:131:25
   }
 
   private updateEntityStream(event: Event): void {
-    if (event.entityId) {
-      const stream = this.streams.find(
-        (s) =>
-          s.entityId === event.entityId && s.eventTypes.includes(event.type)
-      );
-      if (!stream) {
-        this.streams.push({
-          id: event.entityId,
-          entityId: event.entityId,
-          eventTypes: [event.type],
-          lastEventSeq: event.seq,
-        });
-        return;
-      }
-      if (
-        typeof event.expectedLastEntitySeq !== "undefined" &&
-        stream.lastEventSeq !== event.expectedLastEntitySeq
-      ) {
-        throw new Error(
-          `Cannot emit event with expectedLastEntitySeq = ${event.expectedLastEntitySeq}. Stream has lastEventSeq = ${stream.lastEventSeq}`
-        );
-      }
-      stream.lastEventSeq = event.seq;
-    }
+    if (event.entityId) {}
   }
 
killedBy: Emit Events and Check Streams
statusReason: expected [] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] ArrowFunction
src/repos/InMemory.repository.ts:133:9
   private updateEntityStream(event: Event): void {
     if (event.entityId) {
       const stream = this.streams.find(
-        (s) =>
-          s.entityId === event.entityId && s.eventTypes.includes(event.type)
+        () => undefined
       );
       if (!stream) {
killedBy: Emit Events and Check Streams
statusReason: expected [ { id: 'page-1', …(3) }, …(2) ] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:134:11
     if (event.entityId) {
       const stream = this.streams.find(
         (s) =>
-          s.entityId === event.entityId && s.eventTypes.includes(event.type)
+          true
       );
       if (!stream) {
killedBy: Emit Events and Check Streams
statusReason: expected [ { id: 'page-1', …(3) } ] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:134:11
     if (event.entityId) {
       const stream = this.streams.find(
         (s) =>
-          s.entityId === event.entityId && s.eventTypes.includes(event.type)
+          true && s.eventTypes.includes(event.type)
       );
       if (!stream) {
killedBy: Emit Events and Check Streams
statusReason: expected [ { id: 'page-1', …(3) } ] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:136:11
         (s) =>
           s.entityId === event.entityId && s.eventTypes.includes(event.type)
       );
-      if (!stream) {
+      if (false) {
         this.streams.push({
           id: event.entityId,
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: TypeError: Cannot set properties of undefined (setting 'lastEventSeq')

[Killed] BooleanLiteral
src/repos/InMemory.repository.ts:136:11
         (s) =>
           s.entityId === event.entityId && s.eventTypes.includes(event.type)
       );
-      if (!stream) {
+      if (stream) {
         this.streams.push({
           id: event.entityId,
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: TypeError: Cannot set properties of undefined (setting 'lastEventSeq')

[Killed] ObjectLiteral
src/repos/InMemory.repository.ts:137:27
           s.entityId === event.entityId && s.eventTypes.includes(event.type)
       );
       if (!stream) {
-        this.streams.push({
-          id: event.entityId,
-          entityId: event.entityId,
-          eventTypes: [event.type],
-          lastEventSeq: event.seq,
-        });
+        this.streams.push({});
         return;
       }
killedBy: Emit Events and Check Streams
statusReason: expected [ {}, {}, {} ] to strictly equal [ { id: 'page-1', …(3) }, …(1) ]

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:146:9
         return;
       }
       if (
-        typeof event.expectedLastEntitySeq !== "undefined" &&
-        stream.lastEventSeq !== event.expectedLastEntitySeq
+        true
       ) {
         throw new Error(
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: Error: Cannot emit event with expectedLastEntitySeq = undefined. Stream has lastEventSeq = 0

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:146:9
         return;
       }
       if (
-        typeof event.expectedLastEntitySeq !== "undefined" &&
+        true &&
         stream.lastEventSeq !== event.expectedLastEntitySeq
       ) {
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: Error: Cannot emit event with expectedLastEntitySeq = undefined. Stream has lastEventSeq = 0

[Killed] ConditionalExpression
src/repos/InMemory.repository.ts:147:9
       }
       if (
         typeof event.expectedLastEntitySeq !== "undefined" &&
-        stream.lastEventSeq !== event.expectedLastEntitySeq
+        true
       ) {
         throw new Error(
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: Error: Cannot emit event with expectedLastEntitySeq = 2. Stream has lastEventSeq = 2
