[Killed] EqualityOperator
src/repos/InMemory.repository.ts:147:9
       }
       if (
         typeof event.expectedLastEntitySeq !== "undefined" &&
-        stream.lastEventSeq !== event.expectedLastEntitySeq
+        stream.lastEventSeq === event.expectedLastEntitySeq
       ) {
         throw new Error(
killedBy: Emit Events in Reverse Order and Check Streams
statusReason: Event emission failed: Error: Cannot emit event with expectedLastEntitySeq = 0. Stream has lastEventSeq = 0

[NoCoverage] BlockStatement
src/repos/InMemory.repository.ts:158:64
   }
 
   // It should be transactional
-  public async emitEvents(events: Array<Event>): Promise<void> {
-    for (const event of events) {
-      this.emitEvent(event);
-    }
-  }
+  public async emitEvents(events: Array<Event>): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
src/repos/InMemory.repository.ts:159:33
 
   // It should be transactional
   public async emitEvents(events: Array<Event>): Promise<void> {
-    for (const event of events) {
-      this.emitEvent(event);
-    }
+    for (const event of events) {}
   }
 }
