[Killed] BlockStatement
src/utils/Mutex.ts:7:31
 export class Mutex {
   private mutex = Promise.resolve();
 
-  lock(): Promise<() => void> {
-    let begin: (unlock: () => void) => void = (_unlock) => {
-      // Do nothing
-    };
-
-    this.mutex = this.mutex.then(() => new Promise(begin));
-
-    return new Promise((res) => {
-      begin = res;
-    });
-  }
+  lock(): Promise<() => void> {}
 }
 
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: TypeError: unlock is not a function

[Killed] ArrowFunction
src/utils/Mutex.ts:12:34
       // Do nothing
     };
 
-    this.mutex = this.mutex.then(() => new Promise(begin));
+    this.mutex = this.mutex.then(() => undefined);
 
     return new Promise((res) => {
killedBy: Emit Events and Check Streams
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utils/Mutex.ts:14:33
 
     this.mutex = this.mutex.then(() => new Promise(begin));
 
-    return new Promise((res) => {
-      begin = res;
-    });
+    return new Promise((res) => {});
   }
 }
killedBy: Emit Events and Check Streams
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
