[Killed] ArrowFunction
src/events/base.event.ts:26:31
     .describe("Expected sequence number of the stream"),
   type: z.string(),
   version: z.number().safe().finite().int().positive().default(1),
-  createdAt: z.date().default(() => new Date()),
+  createdAt: z.date().default(() => undefined),
   payload: z.record(z.string(), z.unknown()),
   metadata: z
killedBy: Emit Events and Check Streams
statusReason: Event emission failed: [
  {
    "code": "invalid_union",
    "unionErrors": [
      {
        "issues": [
          {
            "code": "invalid_type",
